cases/3-Phasen-aleatorisch/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  foam-extend 5.0
    \\  /    A nd           | PorousMedia: A Wikki Brasil project
     \\/     M anipulation  | Solver: coupledMatrixFoam
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

blockSolver
{
    pAs
    {
        solver              BiCGStab;
        preconditioner      ILUC0;

        tolerance           1e-08;
        relTol              0.001;

        minIter             1;
        maxIter             1000;
    }
}

COUPLED
{
    nOuterCorrectors            30;
    
    residualControl
    {
        pAs
        {
            tolerance   1e-3;
        }
    }
}

relaxationFactors
{
    fields
    {}
    equations 
    {}
}


// ************************************************************************* //
