cases/3-Phasen-aleatorisch/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  foam-extend 5.0
    \\  /    A nd           | PorousMedia: A Wikki Brasil project
     \\/     M anipulation  | Solver: coupledMatrixFoam
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");

interpolationScheme cell;

setFormat raw;

sets
(
    acrossFlow
    {
        type    lineUniform;
        axis    y;
        start   (.5 .5 .5);
        end     (.5 9.5 .5);
        nPoints 10;
    }
);

surfaces        ();

fields          (alpha.water alpha.gas alpha.oil alpha.rock);

// ************************************************************************* //
